{"class_name": "Model", "keras_version": "2.1.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, null, null, 1]}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 32, "kernel_size": [7, 7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_1", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "leaky_re_lu_1"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 16, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_2", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "leaky_re_lu_2"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_3", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "leaky_re_lu_3"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 64, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_4", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "leaky_re_lu_4"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 32, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_5", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "leaky_re_lu_5"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_6", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "leaky_re_lu_6"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 32, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_7", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "leaky_re_lu_7"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_8", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "leaky_re_lu_8"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 128, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_9", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_9", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "leaky_re_lu_9"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_10", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_10", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "leaky_re_lu_10"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 128, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_11", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_11", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "leaky_re_lu_11"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_12", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_12", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "leaky_re_lu_12"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 128, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_13", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_13", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_13", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "leaky_re_lu_13"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 64, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_14", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_14", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_14", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "leaky_re_lu_14"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 128, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_15", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "name": "conv2d_15"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_15", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15"}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_15", "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "leaky_re_lu_15"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "filters": 41, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_16", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_16"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "batch_normalization_16", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_1"}], "output_layers": [["activation_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}